In [2]:
import pandas as pd

In [9]:
pd.read_csv('D:\kabita.csv')

   sequence      Name    mark
0         1  Subhadra       8
1         2    Kabita       0
2         3   Rewangi     -20
3         4    Sakshi      23
4         5     Gouri      90
5         6   Nishant      89
6         7     Pawan  202029

In [7]:
pd.read_excel('D:\\kabita.xlsx')

   sequence      Name    mark
0         1  Subhadra       8
1         2    Kabita       0
2         3   Rewangi   20202
3         4    Sakshi      23
4         5     Gouri      90
5         6   Nishant      89
6         7     Pawan  202029

In [ ]:
pd.read_csv('D:\kabita.csv', )